dashboard/app/controllers/networks_controller.rb

SELECT * FROM "networks"
---
  def index
    @networks = Network.all

SELECT * FROM "networks" WHERE ("networks"."id" = 1)
---
  def show
    @network = Network.find(params[:id])

SELECT * FROM "networks" WHERE ("networks"."id" = 2)
---
  def edit
    @network = Network.find(params[:id])

INSERT INTO "networks" ("updated_at", "always_fill", "enabled", "supports_threshold", "network_name", "pay_type", "created_at") VALUES('2009-09-04 22:14:26', 't', 't', 'f', 'Google AdSense', 'Per Click', '2009-09-04 22:14:26')
---
  def create
    @network = Network.new(params[:network])

    respond_to do |format|
      if @network.save