dashboard/app/controllers/publishers_controller.rb

  def index
    @publishers = Publisher.all
---
SELECT * FROM "publishers"

  def show
    @publisher = Publisher.find(params[:id])
---
SELECT * FROM "publishers" WHERE ("publishers"."id" = 1)

  def create
    @publisher = Publisher.new(params[:publisher])
    if @publisher.save
---
INSERT INTO "publishers" ("updated_at", "publisher_name", "website", "created_at") VALUES('2009-09-04 22:13:54', 'Wikia', 'http://www.wikia.com', '2009-09-04 22:13:54')