dashboard/app/controllers/tags_controller.rb

SELECT * FROM "tags"
---
  def index
    @tags = Tag.all

SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
  def show
    @tag = Tag.find(params[:id])

INSERT INTO "tags" ("network_id", "always_fill", "tier", "sample_rate", "frequency_cap", "tag", "tag_name", "enabled", "value", "rejection_cap", "rejection_time", "publisher_id") VALUES(NULL, 't', 5, 0, 0, '<script>tag here</script>', 'AdSense Catch all ', 't', NULL, 0, 0, NULL)
---
  def create
    @tag = Tag.new(params[:tag])
    respond_to do |format|
      if @tag.save